In [1]:
import  pandas as pd

In [3]:
var = pd.DataFrame({"A":[1,2,3,4,5] , "B":[6,7,8,9,10]})

In [4]:
var

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [5]:
var["C"] = var["A"] + var["B"]

In [6]:
var

   A   B   C
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

write a CSV

In [8]:
dis = {'D':[1,2,3,4,5,6], 'S':[1,2,3,4,5,6], 'E':[1,2,3,4,5,6]}
d = pd.DataFrame(dis)

In [9]:
d

   D  S  E
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

In [10]:
d.to_csv('Test_New.csv')

In [15]:
d.insert(1,'V',d["E"])

In [16]:
d

   D  V  python  S  E
0  1  1       1  1  1
1  2  2       2  2  2
2  3  3       3  3  3
3  4  4       4  4  4
4  5  5       5  5  5
5  6  6       6  6  6

In [21]:
d

   D  V  python  S  E
0  1  1       1  1  1
1  2  2       2  2  2
2  3  3       3  3  3
3  4  4       4  4  4
4  5  5       5  5  5
5  6  6       6  6  6

In [24]:
del d ['python']

In [25]:
d

   D  V  S  E
0  1  1  1  1
1  2  2  2  2
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5
5  6  6  6  6

In [30]:
d.to_csv('Test_New.csv' ,index=True)

In [31]:
with open("name.txt", 'r',encoding='utf-8') as name_file:
    print("Varad Joshi")

FileNotFoundError: [Errno 2] No such file or directory: 'name.txt'